[
  {
    "path": "posts/camtrapr/",
    "title": "camtrapR",
    "description": "camtrapR allows for streamlined and flexible camera trap data management and should be most useful to researchers and practitioners who regularly handle large amounts of camera trapping data",
    "author": [
      {
        "name": "Jürgen Niedballa",
        "url": {}
      }
    ],
    "date": "2022-09-12",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nInstallation\r\nExiftool\r\nCitation\r\n\r\ncamtrapR: Manage camera trap data in R\r\ncamtrapR is a package for camera trap data management in R.\r\nInstallation\r\nYou can install the release version of camtrapR from CRAN:\r\n\r\n\r\ninstall.packages(\"camtrapR\")\r\n\r\n\r\nor the latest GitHub version (containing recent changes and new features) via:\r\n\r\n\r\n# install.packages(\"remotes\")\r\n# install.packages(\"R.rsp\")\r\nremotes::install_github(\"jniedballa/camtrapR\", build_vignettes = TRUE)\r\n\r\n\r\nFor installation from GitHub make sure package R.rsp is available. build_vignettes = TRUE is necessary since v 2.1.1. due to the new static vignettes.\r\nYou can also install a previous version (e.g. if a recent update broke the code you need to run urgently) via:\r\n\r\n\r\nremotes::install_version(package = \"camtrapR\", version = \"2.0.3\")\r\n\r\n\r\nExiftool\r\nNumerous important camtrapR functions read EXIF metadata from JPG images (and videos). This is done via Exiftool, a free and open-source sofware tool developed by Phil Harvey and available for Windows, MacOS and Linux.\r\nTo make full use of camtrapR, you will need Exiftool on your system. You can download it from the Exiftool homepage. Please follow the installation instruction in vignette 1 and the Exiftool website.\r\nYou may not need Exiftool if you do not work with image files, but only use camtrapR to create input for occupancy or spatial capture-recapture models from existing record tables.\r\nHelp and Support\r\nGoogle Group\r\nThere is a Google Group for all questions and problems regarding camtrapR. Please feel free to join the discussion there.\r\nGitHub issues\r\nAlternatively, you can report bugs and problems as issues on GitHub (here).\r\nFurther reading\r\nSee the Article in Methods in Ecology and Evolution for an overview of the package. The five vignettes provide examples for the entire workflow.\r\nCitation\r\nCitation\r\nJürgen Niedballa, Rahel Sollmann, Alexandre Courtiol, Andreas Wilting (2016). camtrapR: an R package for efficient camera trap data management. Methods in Ecology and Evolution 7(12), 1457-1462, https://doi.org/10.1111/2041-210X.12600\r\nor see\r\n\r\n\r\ncitation(\"camtrapR\")\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "https://raw.githubusercontent.com/EcoDynIZW/EcoDynIZW.github.io/main/img/hex-camtrapr.png",
    "last_modified": "2022-09-22T10:44:27+02:00",
    "input_file": {}
  },
  {
    "path": "posts/imageseg/",
    "title": "imageseg",
    "description": "R package for deep learning image segmentation using the U-Net model architecture by Ronneberger (2015), implemented in Keras and TensorFlow. It provides pre-trained models for forest structural metrics (canopy density and understory vegetation density) and a workflow to apply these on custom images",
    "author": [
      {
        "name": "Jürgen Niedballa",
        "url": {}
      }
    ],
    "date": "2022-09-12",
    "categories": [],
    "contents": "\r\nimageseg\r\nR package for deep learning image segmentation using the U-Net model architecture by Ronneberger (2015), implemented in Keras and TensorFlow. It provides pre-trained models for forest structural metrics (canopy density and understory vegetation density) and a workflow to apply these on custom images.\r\nIn addition, it provides a workflow for easily creating model input and model architectures for general-purpose image segmentation based on the U-net architecture. Model can be trained on grayscale or color images, and can provide binary or multi-class image segmentation as output.\r\nThe package can be found on CRAN.\r\nThe preprint of the paper describing the package is available on bioRxiv.\r\nInstallation\r\nFirst, install the R package “R.rsp” which enables the static vignettes.\r\n\r\n\r\n\r\nInstall the imageseg package from CRAN via:\r\n\r\n\r\n\r\nAlternatively you can install from GitHub (requires remotes package and R.rsp):\r\n\r\n\r\n\r\nUsing imageseg requires Keras and TensorFlow. See the vignette for information about installation and initial setup:\r\nTutorial\r\nSee the vignette for an introduction and tutorial to imageseg.\r\n\r\n\r\n\r\nThe vignette covers:\r\n- Installation and setup\r\n- Sample workflow for canopy density assessments\r\n- Training new models\r\n- Continued training of existing models\r\n- Multi-class image segmentation models\r\n- Image segmentation based on grayscale images\r\nForest structure model download\r\nThe models, example predictions, training data and R script for model training for both the canopy and understory model are available from Dryad as a single download.\r\nSee the “Usage Notes” section for details on the dataset.\r\nThe models and script (without the training data) are also hosted on Zenodo and can be downloaded individually from zenodo.\r\nThe pre-trained models for forest canopy density and understory vegetation density are available for download. The zip files contain the model (as .hdf5 files) and example classifications to give an impression of model performance and output:\r\nCanopy model\r\nUnderstory model\r\nPlease see the vignette for further information on how to use these models.\r\nTraining data download\r\nTraining data for both the canopy and understory model are included in the Dryad dataset download in the zip files:\r\nimageseg_canopy_training_data.zip\r\nimageseg_understory_training_data.zip\r\nFor details, please see the Usage Notes and the info.txt files contained in the zip files.\r\nThe training data are not required for users who only wish to use the pre-trained models on their own images.\r\n\r\n\r\n\r\n",
    "preview": "https://raw.githubusercontent.com/EcoDynIZW/EcoDynIZW.github.io/main/img/hex-imageseg.png",
    "last_modified": "2022-09-22T10:44:27+02:00",
  },
  {
    "path": "posts/isorix/",
    "title": "Isorix",
    "description": "This is the development repository of IsoriX, an R package aiming at building isoscapes using mixed models and inferring the geographic origin of organisms based on their isotopic ratios",
    "author": [
      {
        "name": "Alexandre Courtiol",
        "url": {}
      }
    ],
    "date": "2022-09-12",
    "categories": [],
    "contents": "\r\nHow to download and install IsoriX?\r\nYou can download and install the stable version of IsoriX directly from within R by typing:\r\n\r\n\r\ninstall.packages(\"IsoriX\", dependencies = TRUE)\r\n\r\n\r\nNote: if you get into troubles due to gmp, magick, maps, maptools, RandomFields, rgeos, or rgl, retry using simply:\r\n\r\n\r\ninstall.packages(\"IsoriX\")\r\n\r\n\r\nThese packages offer additional functionalities but some of them are particularly difficult to install on some systems.\r\nIf you want the development version of IsoriX, you can download and install it by typing:\r\n\r\n\r\nremotes::install_github(\"courtiol/IsoriX/IsoriX\")\r\n\r\n\r\nMind that you need the R package remotes to be installed for that to work. Mind also that the development version, being under development, can sometimes be broken. So before downloading it make sure that the current build status is build passing. The current built status is provided at the top of this readme document.\r\nAlso, if you access the network via a proxy, you may experience troubles with install_github. In such case try something like:\r\n\r\n\r\nlibrary(httr)\r\nwith_config(use_proxy(\"192.168.2.2:3128\"), devtools::install_github(\"courtiol/IsoriX/IsoriX\"))\r\n\r\n\r\nOff course, unless you are in the same institute than some of us, replace the numbers with your proxy settings!\r\nWhere to learn about IsoriX?\r\nYou can start by reading our bookdown!\r\nThen, if may not be a bad idea to also have a look at our papers: here and there.\r\nAnother great source of help is our mailing list. First register for free (using your Google account) and then feel free to send us questions.\r\nFor specific help on IsoriX functions and objects, you should also check the documentation embedded in the package:\r\n\r\n\r\nhelp(package = \"IsoriX\")\r\n\r\n\r\nin R after having installed and attached (= loaded) the package.\r\nHow can you contribute?\r\nThere are plenty way you can contribute! If you are fluent in R programming, you can improve the code and develop new functions. If you are not so fluent, you can still edit the documentation files to make them more complete and clearer, write new vignettes, report bugs or make feature requests.\r\nSome useful links\r\n\r\n\r\n\r\n",
    "preview": "https://raw.githubusercontent.com/EcoDynIZW/EcoDynIZW.github.io/main/img/hex-isorix.png",
    "last_modified": "2022-09-22T10:44:27+02:00",
    "input_file": {}
  },
  {
    "path": "posts/nlmr/",
    "title": "NLMR",
    "description": "NLMR is an R package for simulating neutral landscape models (NLM). Designed to be a generic framework like NLMpy, it leverages the ability to simulate the most common NLM that are described in the ecological literature. NLMR builds on the advantages of the raster package and returns all simulation as RasterLayer objects, thus ensuring a direct compatibility to common GIS tasks and a flexible and simple usage. Furthermore, it simulates NLMs within a self-contained, reproducible framework.",
    "author": [
      {
        "name": "ropensci",
        "url": {}
      }
    ],
    "date": "2022-09-12",
    "categories": [],
    "contents": "\r\nInstallation\r\nNLMR is not available on CRAN at the moment (see #95). The only way to install NLMR at the moment is:\r\n\r\n\r\n\r\nWindows users need to install RTools first. Rtools provides a compiler and some helpers to compile code for R in Windows. Download Rtools from here and select the appropriate Rtools version (4.0 with R 4.x.x)\r\nInstall Rtools in a directory with no fancy characters in its path, e.g. C:is safe. To install, right click on the Rtools40.exe and select “Run as administrator”. During the installation make sure to select “Add Rtools to PATH”. Otherwise, accept all defaults for everything else.\r\nExample\r\nEach neutral landscape models is simulated with a single function (all starting with nlm_) in NLMR, e.g.:\r\n\r\n\r\nrandom_cluster <- NLMR::nlm_randomcluster(nrow = 100,\r\n                                      ncol = 100,\r\n                                      p    = 0.5,\r\n                                      ai   = c(0.3, 0.6, 0.1),\r\n                                      rescale = FALSE)\r\n\r\nrandom_curdling <- NLMR::nlm_curds(curds = c(0.5, 0.3, 0.6),\r\n                              recursion_steps = c(32, 6, 2))\r\n\r\n\r\nmidpoint_displacememt <- NLMR::nlm_mpd(ncol = 100,\r\n                                 nrow = 100,\r\n                                 roughness = 0.61)\r\n\r\n\r\nSee also\r\nNLMR was split during its development process - to have a minimal dependency version for simulating neutral landscape models and an utility toolbox to facilitate workflows with raster data. If you are interested in merging, visualizing or further handling neutral landscape models have a look at the landscapetools package.\r\n\r\n\r\n\r\n",
    "preview": "https://raw.githubusercontent.com/EcoDynIZW/EcoDynIZW.github.io/main/img/hex-nlmr.png",
    "last_modified": "2022-09-22T10:44:27+02:00",
    "input_file": {}
  },
  {
    "path": "posts/d6package/",
    "title": "The {d6} R package: Simplify workflows of D6 research projects",
    "description": "The goal of the {d6} package is to simplify the project workflow within the department “Ecological Dynamics” at the Leibniz Institute for Zoo and Wildlife Research by providing a standardized folder structure, templates for reports and utility functions.",
    "author": [
      {
        "name": "Cédric Scherer",
        "url": "htttps://cedricscherer.com"
      }
    ],
    "date": "2020-09-12",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nInstallation\r\nCreate Project Directory\r\nUse A Custom Root Directory\r\nUse Version Control\r\nSetup without Geo Directories\r\nAdd Documentation to Your Project\r\n\r\nInstall Common Packages\r\nUse Custom Rmarkdown Templates\r\nRender Rmarkdown Files to Reports\r\nAcknowledgements\r\n\r\nThe d6 package aims to simplify workflows of our D6 research projects by providing a standardized folder structure incl. version control, Rmarkdown templates, and other utilities.\r\nThere are four main functionalities:\r\nCreate standardized project directories with\r\nnew_project()\r\nInstall a set of common packages with\r\ninstall_d6_packages()\r\nProvide custom Rmarkdown templates via\r\nFile > New File > Rmarkdown... > From Template\r\nRender all Rmarkdown documents to ./docs/report with\r\nrender_all_reports() or\r\nrender_report()\r\n\r\nInstallation\r\nThe package is not on CRAN and needs to be installed from GitHub. To do\r\nso, open Rstudio and run the following two lines in the console. In case\r\nthe {devtools} package is already installed, skip that step.\r\n\r\n\r\ninstall.packages(\"devtools\")\r\ndevtools::install_github(\"EcoDynIZW/d6\")\r\n\r\n\r\nIf you are asked if you want to update other packages either\r\npress “No” (option 3) and continue or update the packages before running\r\nthe install command again.\r\n\r\nCreate Project Directory\r\nRun the function new_project() to create a new project. This will\r\ncreate a standardized directory with all the scaffolding we use for all\r\nprojects in our department. It also add several files needed for\r\ndocumentation of your project.\r\nTo start a new project in the current working directory, simply run:\r\n\r\n\r\nd6::new_project(\"unicornus_wl_sdm_smith_j\")\r\n\r\n\r\nPlease give your project a unique and descriptive name:\r\nspecies_country_topic_name\r\nFor example, when John Smith is developing a species distribution models\r\nfor unicorns in Wonderland, a descriptive title could be:\r\nunicornus_wl_sdm_smith_j. Please use underscores and the\r\ninternational Alpha-2 encoding for\r\ncountries.\r\nThe main folders created in the root folder (here\r\nunicornus_wl_sdm_smith_j) are the following:\r\n\r\n.\r\n└── unicornus_wl_sdm_smith_j\r\n    ├── data-raw\r\n    ├── docs\r\n    ├── output\r\n    ├── plots\r\n    └── R\r\n\r\nThe full scaffolding structure including all subdirectories and\r\nadditional files looks like this:\r\n\r\n. \r\n└── unicornus_wl_sdm_smith_j\r\n    ├── .Rproj.user         —  Rproject files\r\n    ├── data-raw            —  raw data (tabular data in root folder)\r\n    │    └── geo-raw        —  raw spatial data\r\n    ├── docs                —  documents\r\n    │   ├── admin           —  adminstrative docs, e.g. permits \r\n    │   ├── literature      —  literature used for parameterization + ms\r\n    │   ├── manuscript      —  manuscript drafts (main + supplement)\r\n    │   ├── presentations   —  talks and poster presentations\r\n    │   └── reports         —  rendered reports\r\n    ├── output              —  everything that is computed (except plots)\r\n    │   ├── data-proc       —  processed tabular data\r\n    │   └── geo-proc        —  processed spatial data\r\n    ├── plots               —  plot output\r\n    ├── R                   —  scripts\r\n    │   ├── 00_start.R      —  first script to run\r\n    │   └── XX_submit.R     —  final script to run\r\n    ├── .gitignore          —  contains which files to ignore for version control\r\n    ├── .Rbuildignore       —  contains which files to ignore for package builds\r\n    ├── DESCRIPTION         —  contains project details and package dependencies\r\n    ├── NAMESPACE           —  contains context for R objects\r\n    └── project.Rproj       —  Rproject file: use to start your project\r\n\r\n\r\nUse A Custom Root Directory\r\nYou don’t need to change the working directory first—you can also\r\nspecify a path to a custom root folder in which the new project folder\r\nis created:\r\n\r\n\r\n## both work:\r\nd6::new_project(\"unicornus_wl_sdm_smith_j\", path = \"absolute/path/to/the/root/folder\")\r\n## or:\r\nd6::new_project(\"unicornus_wl_sdm_smith_j\", path = \"absolute/path/to/the/root/folder/\")\r\n\r\n\r\nThe resulting final directory of your project would be\r\nabsolute/path/to/the/root/folder/unicornus_wl_sdm_smith_j.\r\n\r\nUse Version Control\r\nIf you want to create a GitHub repository for the project at the same\r\ntime, use instead:\r\n\r\n\r\nd6::new_project(\"unicornus_wl_sdm_smith_j\", github = TRUE)\r\n\r\n\r\nBy default, the visibility of the GitHub repository is set to “private”\r\nbut you can also change that:\r\n\r\n\r\nd6::new_project(\"unicornus_wl_sdm_smith_j\", github = TRUE, private_repo = FALSE)\r\n\r\n\r\nNote that to create a GitHub repo you will need to have configured your\r\nsystem as explained\r\nhere.\r\n\r\nSetup without Geo Directories\r\nIf your project does not (or will not) contain any spatial data, you can\r\nprevent the creation of the directories geo-raw and geo-proc by\r\nsetting geo to FALSE:\r\n\r\n\r\nd6::new_project(\"unicornus_wl_sdm_smith_j\", geo = FALSE)\r\n\r\n\r\n\r\nAdd Documentation to Your Project\r\nAfter you have set up your project directory, open the file 00_start.R\r\nin the R folder. Add the details of your project, fill in the readme,\r\nadd a MIT license (if needed) and add package dependencies.\r\n\r\nInstall Common Packages\r\nYou can install the packages that are most commonly used in our\r\ndepartment via install_d6_packages():\r\n\r\n\r\nd6::install_d6_packages()\r\n\r\n\r\nNote that this function is going to check preinstalled versions and will\r\nonly install packages that are not installed with your current R\r\nversion.\r\nAgain, there is an arguement geo so you can decide if you want to\r\ninstall common geodata packages as well (which is the default). If you\r\nare not intending to process geodata, set geo to FALSE:\r\n\r\n\r\nd6::install_d6_packages(geo = FALSE)\r\n\r\n\r\nThe default packages that are going to be installed are:\r\n\r\ntidyverse (tibble, dplyr, tidyr, ggplot2, readr, forecats, stringr, purrr), lubridate, here, vroom, patchwork, usethis\r\n\r\nThe following packages will be installed in case you specify\r\ngeo = TRUE:\r\n\r\nrgdal, geos, raster, sp, sf, tmap\r\n\r\n\r\nUse Custom Rmarkdown Templates\r\nThe package also provides several templates for your scripts. In\r\nRstudio, navigate to File > New File > RMarkdown... > Templates and\r\nchoose the template you want to use. All templates come with a\r\npreformatted YAML header and chunks for the setup.\r\nThe following templates are available for now:\r\nEcoDynIZW Basic: Template for a basic Rmarkdown research report\r\nincluding bits of codes and comments to get started\r\nEcoDynIZW Minimal: Template for an Rmarkdown research report\r\n(almost empty)\r\n\r\nRender Rmarkdown Files to Reports\r\nThe render_*() functions take care of knitting your Rmarkdown files\r\ninto HTML reports. The functions assume that your .Rmd files are saved\r\nin the R directory or any subdirectory, and will store the resulting\r\n.html files in the according directory, namely ./docs/reports/.\r\nYou can render all .Rmd files that are placed in the R directory and\r\nsubdirectories in one step:\r\n\r\n\r\nd6::render_all_reports()\r\n\r\n\r\nYou can also render single Rmarkdown documents via render_report():\r\n\r\n\r\nd6::render_report(\"my-report.Rmd\")\r\nd6::render_report(\"notsurewhybutIhaveasubfolder/my-report.Rmd\")\r\n\r\n\r\n\r\nAcknowledgements\r\nThis package would not exist without the work of many great people!\r\nThe code to create the project folder is based on the template\r\npackage by Francisco\r\nRodriguez-Sanchez (and\r\nreferences therein)\r\nThe 00_start script is inspired by the {golem}\r\npackage\r\nRstudio for the development of Rmarkdown and all the great things\r\nthat come with it (knitting, templates, themes, …)\r\nAttribution-NonCommercial-ShareAlike 4.0 International (CC BY-NC-SA 4.0)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "https://raw.githubusercontent.com/EcoDynIZW/EcoDynIZW.github.io/main/img/hex-d6.png",
    "last_modified": "2022-09-22T10:44:27+02:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Ecological Dynamics",
    "description": "Welcome! This is our page for the newly founded IZW department Ecological Dynamics. We hope you enjoy \nreading what we have to say and share!",
    "author": [
      {
        "name": "Stephanie Kramer–Schadt",
        "url": {}
      }
    ],
    "date": "2019-01-01",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-20T17:39:38+02:00",
    "input_file": {}
  }
]
